Term4/matlog/lectures/11.org
#+LATEX_CLASS: general
#+TITLE: Лекция 11
#+AUTHOR: Ilya Yaroshevskiy
#+LATEX_HEADER: \newcommand{\gedel}[1]{\custombracket{\ulcorner}{\urcorner}{#1}}


* Геделева нумерация
#+NAME: Гёделева нумерация
#+begin_definition org
\((\gedel{\bullet})\)
#+ATTR_LATEX: :align l|l
| \(s\)       | \(\gedel{s}\)                 |
|-------------+-------------------------------|
| \((\)       | \( 3\)                        |
|-------------+-------------------------------|
| \()\)       | \( 5\)                        |
|-------------+-------------------------------|
| \(,\)       | \( 7\)                        |
|-------------+-------------------------------|
| \(\&\)      | \( 9\)                        |
|-------------+-------------------------------|
| \(\vee\)    | \(11\)                        |
|-------------+-------------------------------|
| \(\neg\)    | \(13\)                        |
|-------------+-------------------------------|
| \(\to\)     | \(15\)                        |
|-------------+-------------------------------|
| \(\forall\) | \(17\)                        |
|-------------+-------------------------------|
| \(\exists\) | \(19\)                        |
|-------------+-------------------------------|
| \(.\)       | \(21\)                        |
|-------------+-------------------------------|
| \(f^n_k\)   | \(23 + 6\cdot 2^n \cdot 3^k\) |
|-------------+-------------------------------|
| \(P^n_k\)   | \(25 + 6\cdot 2^n\cdot 3^k\)  |
|-------------+-------------------------------|
| \(x_k\)     | \(27 + 6\cdot 2^k\)           |
Тогда известные функции будут:
- \((=) = P^2_0\)
- \((0) = f^0_0\)
- \((+) = f^2_0\)
- \((\cdot) = f^2_1\)
- \((') = f^1_0\)
#+end_definition
#+NAME: Гёделева нумерация_список
#+begin_definition org
\(\gedel{a_0a_1\dots a_{n - 1}} = 2^{\gedel{a_0}}\cdot 3^{\gedel{a_1}} \cdot \dots \cdot p_n^{\gedel{a_{n - 1}}}\)
#+end_definition
#+NAME: Гёделева нумерация_список строк
#+begin_definition org
\(S_0\ S_1\ S_2 = 2^{\gedel{S_0}}\cdot 3^{\gedel{S_1}}\cdot\dots\cdot p_n^{\gedel{S_n}}\)
#+end_definition
#+NAME: Гёделева нумерация_простые
#+begin_remark org
\(p_i\) --- \(i\)-е простое (\(p_1 = 2\))
#+end_remark
#+begin_examp org
\(\gedel{a = 0} = 2^{27 + 6}\cdot 3^{25 + 6\cdot 4}\cdot 5^{23 + 6}\)
#+end_examp
#+begin_theorem org
Рассмотрим функцию \(\mathop{\rm Proof}(x, p) = \begin{cases}
  1 & \text{если }p\text{ --- геделев номер доказательства }\chi \\
  0 & \text{иначе}
\end{cases}\), Proof --- рекурсивна
#+end_theorem
#+NAME: Рекурсивность представимых в формальной арифметике функций
#+begin_theorem org
Если функция представима в формальной арифметике, то она рекурсивна
#+end_theorem
#+begin_proof org
\(f: \N^n \to \N\), т.е. существует формула \(\varphi\) с \(n + 1\) свободными переменными \(x_1, \dots, x_{n + 1}\). Если \(f(k_1, \dots, k_n) = k_{n + 1}\) \\
*_Ожидаем_* \(\vdash \varphi(\overline{k_1}, \dots, \overline{k_n}, \overline{k_{n + 1}})\), т.е. существует доказательство \(\delta\) --- последовательность \(\delta_1, \dots, \delta_t\)
\[ \mathop{\rm Proof}(\gedel{\varphi{\overline{k_1}, \dots, \overline{k_{n + 1}}}}, \gedel{k}) = 1 \]
#+begin_export latex
\begin{array}{l}
S\langle{\rm plog}_2, \\
\quad M \langle S \langle {\rm Proof}, \\
\quad\quad S\pair{{\rm Subst}_{n + 1}, \gedel{\varphi}, P^2_{n + 1}, P^3_{n + 1}, \dots, P^{n + 1}_{n + 1}, S\pair{{\rm plog}_2, P^1_{n + 2}}}, \\
\quad\quad S \pair{{\rm plog}_3, P^1_{n + 1}} \\
\quad \rangle \\
\rangle
\end{array} \\
#+end_export
#+end_proof
#+NAME: Subst
#+begin_remark org
\({\rm Subst}\) --- функция которая подставляет аргументы в формулу
#+end_remark
#+NAME: про \sigma
#+begin_remark org
\(\chi\) --- формула формальной арифметики
\[ W_1(\gedel{\chi}, \gedel{p}) = \begin{cases} 0 & \text{если }p\text{ --- доказательство }\chi[x_0\coloneqq\overline{\gedel{\chi}}] \\ 1 & \text{иначе} \end{cases} \]
Реализация \(W_1\) через Subst очевидна, тогда \(W_1\) представима в формальной арифметике формулой \(\omega_1\).
\(\sigma(x) = \forall p. \neg \omega_1(x, p)\) --- ``самоприменение \(x\) недоказуемо``
\[\vdash^? \sigma(\overline{\gedel{\sigma}})\]
#+end_remark
#+NAME: \omega-непротиворечивость
#+begin_definition org
\(\omega\)-непротиворечивость. Теория \(\omega\)-непротиворечива, если для любой формулы \(\varphi(x)\):
- если \(\vdash \varphi(\overline{0}), \vdash \varphi(\overline{1}), \dots\), то \(\not\vdash \exists x. \neg \varphi(x)\)
#+end_definition
#+NAME: Непротиворечивость (эквивалентные определения, доказательство эквивалентности)
#+begin_lemma org
Если теория \(\omega\)-непротиворечива, то непротиворечива
#+end_lemma
#+begin_proof org
Рассмотрим \(\varphi(x) \coloneqq x = x\)
\[ \vdash \overline{0} = \overline{0} \quad \vdash \overline{1} = \overline{1} \quad \dots\]
Т.е. \(\not\vdash \exists x. x\neq x\)
#+end_proof
#+NAME: Первая теорема Гёделя о неполноте арифметики
#+ATTR_LATEX: :options [Геделя о неполноте арифметики №1]
#+begin_theorem org
\-
1. Если формальная арифметика непротиворечива, то \(\not\vdash \sigma(\overline{\gedel{\sigma}})\)
2. Если формальная арифметика \(\omega\)-непротиворечива, то \(\not\vdash \neg \sigma(\overline{\gedel{\sigma}})\)
#+end_theorem
#+begin_proof org
\-
1. Пусть \(\vdash \sigma(\overline{\gedel{\sigma}})\), т.е. существует \(p\) --- геделев номер доказательства
   \[ \vdash \sigma(\overline{\gedel{\sigma}}) \quad \vdash \forall p. \neg \omega_1(\overline{\gedel{\sigma}}, p) \]
   С другой стороны, \(W_1(\gedel{\sigma}, p) = 0\), т.е. \(\vdash \omega_1(\overline{\gedel{\sigma}}, p)\)
2. Пусть \(\vdash \neg \sigma(\overline{\gedel{\sigma}})\)
   \[ \vdash \exists p. \omega_1(\overline{\gedel{\sigma}}, p) \]
      \[ \left.\begin{matrix}
   \vdash \neg \omega_1(\overline{\gedel{\sigma}}, \overline{0}) \\
   \vdash \neg \omega_1(\overline{\gedel{\sigma}}, \overline{1}) \\
   \vdash \neg \omega_1(\overline{\gedel{\sigma}}, \overline{2}) \\
   \vdots
   \end{matrix}\right\} \text{ иначе} \vdash \sigma(\overline{\gedel{\sigma}})  \]
   \[ \not\vdash \exists p. \omega_1(\overline{\gedel{\sigma}}, p) \]
#+end_proof
#+NAME: Неполнота арифметики
#+begin_corollary org
Формальная арифметика со стандартной интерпретацией неполна
#+end_corollary
#+begin_proof org
\todo
#+end_proof
#+NAME: Формулировка первой теоремы Гёделя о неполноте арифметики в форме Россера
#+ATTR_LATEX: :options [Геделя о неполноте арифметики №1 в форме Россера]
#+begin_theorem org
\[ W_2(x, p) = \begin{cases} 0 & \text{если }p\text{ --- доказательство }\lnot x(\overline{\gedel{x}}) \\ 1 & \text{иначе} \end{cases} \]
\(\omega_2\) --- формула соответствующая \(W_2\)
\[ \rho(x) = \forall p. \omega_1(x, p) \to \exists q. q < p \& \omega_2(x, q) \]

1. Если формальная арифметика непротиворечива, то \(\not\vdash \rho(\overline{\gedel{\rho}})\)
2. Если формальная арифметика непротиворечива, то \(\not\vdash \neg\rho(\overline{\gedel{\rho}})\)
#+end_theorem
\todo
#+NAME: Consis
#+begin_definition org
\[{\rm Consis} \equiv \forall p. \neg \pi(\overline{\gedel{1 = 0}}, p)\]
\(\pi\) --- формула соответствующая \(Proof(x, p)\), т.е. \(p\) --- доказательство \(x\)
#+end_definition

#+NAME: Формулировка второй теоремы Гёделя о неполноте арифметики
#+ATTR_LATEX: :options [Геделя о неполноте арифметики №2]
#+begin_theorem org
\[ \vdash {\rm Consis} \to \sigma{\overline{\gedel{\sigma}}} \]
Т.е. если докажем, что если формальная арифметика непротиворечива, то автоматически \(\sigma(\overline{\gedel{\sigma}})\), т.е. ФА противоречива
#+end_theorem
#+NAME: Неформальное пояснение метода доказательства
#+ATTR_LATEX: :options [Схема]
#+begin_proof org
Прочтем что написано в теореме: \(\sigma(\overline{\gedel{\sigma}})\) раскрывается в \(\forall p. \neg \omega_1(\overline{\gedel{\sigma}}, p)\), т.е. если формальная арифметика непротиворечива, то не существует \(p\), который доказывает \(\sigma(\overline{\gedel{\sigma}})\), а это в точности утверждение теоремы Геделя о неполноте №1. Т.е. эта теорема --- формализация теоремы Геделя о неполноте №1.
#+end_proof
#+NAME: Формулировка второй теоремы Гёделя о неполноте арифметики_след
#+begin_corollary org
Никакая теория, содержащая формальную арифметику, не может доказать свою непротиворечивость
#+end_corollary

